In [9]:
# You may need to run follwing command on the command line (if you run here will give you an error)
# pip install pyodbc

In [28]:
# Run this command below and get the ODBC version and put it on your connection string 
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client 11.0',
 'ODBC Driver 17 for SQL Server',
 'SQL Server Native Client RDA 11.0',
 'PostgreSQL ANSI(x64)',
 'PostgreSQL Unicode(x64)',
 'Amazon Redshift (x64)',
 'Microsoft Access Driver (*.mdb, *.accdb)',
 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)',
 'Microsoft Access dBASE Driver (*.dbf, *.ndx, *.mdx)',
 'Microsoft Access Text Driver (*.txt, *.csv)']

In [61]:
import pandas as pd
import pyodbc
import time
start_time = time.time()

cnxn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                      "Server=MUHAMMEDPC;"
                      "Database=ExcelBI;"
                      "Trusted_Connection=yes;")


# cursor = cnxn.cursor()
# cursor.execute('SELECT Top(10) * FROM Sales')

# for row in cursor:
#     print('row = %r' % (row,))
    
df = pd.read_sql_query('SELECT Top(10) * FROM Sales', cnxn)

print("--- %s seconds ---" % (time.time() - start_time))

--- 0.24560904502868652 seconds ---

In [58]:
df

        ProductID        Date    Zip  Units   Revenue Country
0             690  2008-01-16  01001      1  375.1125     USA
1            1085  2008-03-14  01001      1   91.8225     USA
2             763  2008-03-14  01001      1  333.3225     USA
3            2331  2008-04-14  01001      1  614.1975     USA
4            1000  2008-05-16  01001      1   99.6975     USA
...           ...         ...    ...    ...       ...     ...
999995       1254  2008-01-30  29316      1  446.1450     USA
999996        792  2008-05-30  29316      1   70.8225     USA
999997        764  2008-06-10  29316      1  333.3225     USA
999998       2090  2008-05-21  29316      1  362.1975     USA
999999        609  2008-04-17  29316      1  897.4875     USA

[1000000 rows x 6 columns]